app/controllers/tv_shows_controller.rb

  def index
  	if params["search_key"]
  		@tv_shows = TvShow.where(show: params["search_key"]).or(TvShow.where(channel: params[:search_key]))
    else
    	@tv_shows = TvShow.all
---
SELECT `tv_shows`.* FROM `tv_shows` WHERE (`tv_shows`.`show` = 'm' OR `tv_shows`.`channel` = 'm')
SELECT `tv_shows`.* FROM `tv_shows`

  def set_favourite
    @user = User.first                          #just picked a user. we can use any user authentication way e.g devise gem
    @show = TvShow.find(params["id"])
    @user.tv_shows << @show
    ReminderMailer.with(user: @user,show: @show).vsubmission.deliver_now
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `tv_shows`.* FROM `tv_shows` WHERE `tv_shows`.`id` = 3 LIMIT 1
SELECT `tv_shows`.* FROM `tv_shows` INNER JOIN `tv_shows_users` ON `tv_shows`.`id` = `tv_shows_users`.`tv_show_id` WHERE `tv_shows_users`.`user_id` = 1